Repository: IdentityServer/Thinktecture.IdentityServer2
Catalog: src/Libraries/Thinktecture.IdentityServer.Core/Resources/Models/Configuration/AdfsIntegrationConfiguration.*.resx
Languages: fr

# EncryptionCertificate
source: ADFS Encryption certificate
fr: Certificat de chiffrement ADFS

# EncryptionCertificateDescription
source: ADFS Encryption certificate
fr: Certificat utilisé pour le chiffrement ADFS

# FederationEndpoint
source: ADFS Federation Endpoint
fr: Terminaison fédérée ADFS

# FederationEndpointDescription
source: Address of the ADFS federation endpoint (mixed/symmetric/basic256).
fr: Spécifie la terminaison pour le protocole fédéré ADFS.

# IssuerThumbprint
source: ADFS Signing Certificate Thumbprint
fr: Empreinte du certificat de chiffrement ADFS

# IssuerThumbprintDescription
source: Thumbprint of the ADFS signing certificate.
fr: Empreinte du certificat de chiffrement utilisée pour ADFS.

# IssuerUri
source: ADFS Issuer URI
fr: URI de l’émetteur ADFS

# IssuerUriDescription
source: ADFS Issuer URI
fr: Identifiant unique pour l’émetteur ADFS.

# JwtAuthenticationEnabled
source: Enable JWT authentication
fr: Activer l’authentification JWT

# JwtAuthenticationEnabledDescription
source: Enables the OAuth2 to ADFS authentication bridge
fr: Active le pont d’authentification OAuth2 à ADFS.

# JwtAuthenticationEnabledRequiresFederationEndpointErrorMessage
source: FederationEndpoint required when JwtAuthenticationEnabled is enabled.
fr: « Terminaison fédérée ADFS » est requis lorsque « JwtAuthenticationEnabled » est actif.

# SamlAuthenticationEnabled
source: Enable SAML authentication
fr: Activer l’authentification SAML

# SamlAuthenticationEnabledDescription
source: Enables the OAuth2 to ADFS authentication bridge
fr: Active le pont d’authentification OAuth2 à ADFS.

# SamlAuthenticationEnabledRequiresFederationEndpointErrorMessage
source: FederationEndpoint required when SamlAuthenticationEnabled is enabled.
fr: « Terminaison fédérée ADFS » est requis lorsque « SamlAuthenticationEnabled » est actif.

# UsernameAuthenticationEnabled
source: Enable username/password authentication
fr: Activer l’authentification nom d’utilisateur/mot de passe

# UsernameAuthenticationEnabledDescription
source: Enables the OAuth2 to ADFS authentication bridge
fr: Active le pont d’authentification OAuth2 à ADFS.

# UserNameAuthenticationEnabledRequiresUserNameAuthenticationEndpointErrorMessage
source: UserNameAuthenticationEndpoint required when UsernameAuthenticationEnabled is enabled.
fr: « Terminaison ADFS utilisateur/mot de passe » est requis lorsque « authentification nom d’utilisateur/mot de passe » est actif.

# UserNameAuthenticationEndpoint
source: ADFS UserName Endpoint
fr: Terminaison ADFS utilisateur/mot de passe

# UserNameAuthenticationEndpointDescription
source: Address of the ADFS UserNameMixed endpoint.
fr: Spécifie la terminaison ADFS UserNameMixed.

# AuthenticationTokenLifetime
source: Lifetime of the token
fr: Durée de vie d’un jeton

# AuthenticationTokenLifetimeDescription
source: Specifies the lifetime of the token (in minutes)
fr: Durée de vie d’un jeton (en minutes)

# AuthenticationTokenLifetimeRangeErrorMessage
source: AuthenticationTokenLifetime cannot be negative
fr: La « durée de vie d’un jeton » ne peut être une valeur négative.

# JwtAuthenticationEnabledRequiresIssuerUriErrorMessage
source: IssuerUri required when JwtAuthenticationEnabled is enabled.
fr: « URI de l’émetteur ADFS » est requis lorsque « JwtAuthenticationEnabled » est actif.

# PassThruAuthenticationToken
source: Pass-through authentication token
fr: Jeton d’authentification transitoire

# PassThruAuthenticationTokenDescription
source: If enabled, the original SAML token from ADFS will be passed back, otherwise the token will be converted to a JWT.
fr: Lorsque actif, le jeton SAML original provenant du ADFS transite sans altération, sinon le jeton est converti en jeton JWT.

# PassThruAuthenticationTokenRequiresIssuerThumbprintErrorMessage
source: IssuerThumbprint required when PassThruAuthenticationToken is false.
fr: « Empreinte du certificat de chiffrement ADFS » est requis lorsque « Jeton d’authentification transitoire » est désactivé.

# SamlAuthenticationEnabledRequiresIssuerThumbprintErrorMessage
source: IssuerThumbprint required when SamlAuthenticationEnabled is enabled.
fr: « Empreinte du certificat de chiffrement ADFS » est requis lorsque « Authentification SAML » est actif.

# SamlAuthenticationEnabledRequiresIssuerUriErrorMessage
source: IssuerUri required when SamlAuthenticationEnabled is enabled.
fr: « URI de l’émetteur ADFS » est requis lorsque « Authentification SAML » est actif.
